
&НаКлиенте
Процедура ЗапуститьТестирование(Команда)
	ОчиститьСообщения();
	Сообщить("=== ЗАПУСК ДИАГНОСТИКИ МИКРОСЕРВИСА CLICKHOUSE ===");
	
	НастройкиЗаполнены = ПроверитьНастройкиНаСервере();
	Если Не НастройкиЗаполнены Тогда
		Сообщить("[X] ТЕСТ ПРЕРВАН: Заполните параметры подключения в РС КХ_НастройкиПодключения!");
		Возврат;
	КонецЕсли;
	
	ТестироватьСерверныеМодули();
	
	Сообщить("=== ТЕСТИРОВАНИЕ ЗАВЕРШЕНО ===");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНастройкиНаСервере()
	
	Настройки = КХ_ИнтеграцияСлужебный.ПолучитьНастройкиИзРегистра();
	
	Если ПустаяСтрока(Настройки.АдресСервера) 
		Или ПустаяСтрока(Настройки.Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Сообщить("[✓] 1. Регистр настроек прочитан. Путь к DLL: " + Настройки.ПутьККомпоненте);
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ТестироватьСерверныеМодули()

	Попытка
		ВК = КХ_ЯдроПовИсп.ПолучитьПодключениеClickHouse();
		Если ВК = Неопределено Тогда
			ВызватьИсключение "Ядро вернуло Неопределено.";
		КонецЕсли;
		Сообщить("[✓] 2. Модуль КХ_ЯдроПовИсп успешно инициализировал компоненту в памяти сессии.");
		ЧистаяВерсия = СтрЗаменить(ВК.Версия, Символы.ПС - Символы.ПС, "");
		ЧистаяВерсия = СтрЗаменить(ВК.Версия, Символ(0), "");
		
		Сообщить("      Версия Rust-бинарника: " + ЧистаяВерсия);
	Исключение
		Сообщить("[X] ОШИБКА модуля КХ_ЯдроПовИсп: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	Попытка
		РезультатПинга = КХ_Данные.ВыполнитьЗапрос("SELECT version()");
		
		Если Найти(РезультатПинга, "Ошибка") > 0 Тогда
			ВызватьИсключение РезультатПинга;
		КонецЕсли;
		
		Сообщить("[✓] 3. Слой выкачки КХ_Данные проверен. Связь с ClickHouse стабильна.");
		ЧистыйJSON = КХ_ИнтеграцияСлужебный.ОчиститьСтрокуОтНулей(РезультатПинга);
		Сообщить("      Версия СУБД (Чистый JSON):\n" + ЧистыйJSON);
	Исключение
		Сообщить("[X] ОШИБКА выполнения тестового запроса: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка
		КХ_Данные.ВыполнитьЗапрос("CREATE DATABASE IF NOT EXISTS system_1c");
		КХ_Данные.ВыполнитьЗапрос("CREATE TABLE IF NOT EXISTS system_1c.metrics(event_time DateTime64(3) DEFAULT now(), event_type LowCardinality(String), event_name String, duration_ms UInt32, status LowCardinality(String), user LowCardinality(String), comment String, payload Map(String, String) ) ENGINE = MergeTree() ORDER BY (event_type, event_name, event_time)");

		Метрика = КХ_Мониторинг.НачатьЗамер("diagnostic", "ПроверкаВнутреннейОбработки");
		Метрика.Контекст.Вставить("ТипЗапуска", "Внутренний");
		Метрика.Контекст.Вставить("Контекст", "Диагностика");
		КХ_Мониторинг.ФиксироватьМетрику(Метрика, "Success");
		Сообщить("[✓] 4. API-модуль КХ_Мониторинг успешно обработал замер и передал в кэш компоненты.");
	Исключение
		Сообщить("[X] ОШИБКА слоя логирования КХ_Мониторинг: " + ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		КХ_Данные.ВыполнитьЗапрос("CREATE DATABASE IF NOT EXISTS default");
		КХ_Данные.ВыполнитьЗапрос("CREATE TABLE IF NOT EXISTS default.test_internal_tz ( row_id UInt64, message String, is_test Bool, timestamp DateTime ) ENGINE = Log()");
		КХ_Данные.ВыполнитьЗапрос("TRUNCATE TABLE default.test_internal_tz");

		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("row_id", Новый ОписаниеТипов("Число"));
		ТЗ.Колонки.Добавить("message", Новый ОписаниеТипов("Строка"));
		ТЗ.Колонки.Добавить("is_test", Новый ОписаниеТипов("Булево"));
		ТЗ.Колонки.Добавить("timestamp", Новый ОписаниеТипов("Дата"));
		
		Для Ид = 1 По 3 Цикл
			Стр = ТЗ.Добавить();
			Стр.row_id = Ид;
			Стр.message = "Диагностическая строка метаданных №" + Ид;
			Стр.is_test = Истина;
			Стр.timestamp = ТекущаяДата();
		КонецЦикла;

		КХ_Данные.ВкачатьТаблицуЗначений("default.test_internal_tz", ТЗ);
		Сообщить("[✓] 5. Потоковый конвертер ТЗ -> TSV отработал без bottleneck. Пакет ушел в Rust.");
		//КХ_Данные.СброситьКэшПамяти();  
		//Сообщить("[✓] 6. Метод СбросКэша успешно вызван через модуль КХ_Данные.");
		//ОтветКоличества = КХ_Данные.ВыполнитьЗапрос("SELECT count() as cnt");

		//ДанныеОтвета = КХ_ИнтеграцияСлужебный.РаспарситьОтветClickHouse(ОтветКоличества);
		//КоличествоСтрок = ДанныеОтвета.data[0]["cnt"];
		//
		//Сообщить("Валидация данных успешна. Физически записано строк в ClickHouse: " + КоличествоСтрок);
		
	Исключение
		Сообщить("[X] ОШИБКА пакетной вставки ТЗ: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры